benchmarks/national_parks/mcpeval.yaml
$schema: ../../schema/mcpeval.config.schema.json
name: National Parks MCP Server Test Suite
description: Evaluation of National Parks MCP server capabilities
mcp:
  servers:
    nationalparks:
      transport: stdio
      command: npx
      args:
      - -y
      - mcp-server-nationalparks
      env:
        NPS_API_KEY: JrE4X9TtvoNopzA1AGQeAmvhHggUMDP9Tak4QOxX
provider: anthropic
model: claude-sonnet-4-20250514
default_agent: nationalparks_agent
agents:
  definitions:
  - name: nationalparks_agent
    instruction: 'you are a helpful assistant that provides information about national
      parks.

      '
    server_names:
    - nationalparks
judge:
  min_score: 0.8
  max_tokens: 2000
  system_prompt: 'You are an expert evaluator of national park information retrieval
    tasks.

    Consider accuracy, completeness, error handling, and efficiency.

    '
  provider: anthropic
  model: claude-sonnet-4-20250514
metrics:
  collect:
  - response_time
  - total_duration
  - iteration_count
  - tool_coverage
  - tool_success_rate
  - unique_tools_used
  - unique_servers_used
  - parallel_tool_calls
  - max_concurrent_operations
  - token_usage
  - input_tokens
  - output_tokens
  - cost_estimate
  - llm_time
  - tool_time
  - reasoning_time
  - idle_time
  - error_count
  - error_rate
  - success_rate
  - path_efficiency_score
  - content_extraction_quality
  - error_recovery
reporting:
  formats:
  - json
  - markdown
  output_dir: ./test-reports
  include_traces: true
execution:
  max_concurrency: 3
  timeout_seconds: 120
  retry_failed: false